# -*- mode: ruby -*-
# Brewfile
#
# Use `brew bundle install --file <Brewfile>` to install the formulas listed below.

brew 'age'
brew 'ansible'
brew 'ansible-lint'
brew 'asdf'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'btop'
brew 'bzip2'
brew 'ca-certificates'
brew 'cmatrix'
brew 'coreutils'
brew 'csshx'
brew 'curl'
brew 'diff-so-fancy'
brew 'direnv'
brew 'dockutil'
brew 'dos2unix'
brew 'exiftool'
brew 'eza'
brew 'fd'
brew 'ffmpegthumbnailer'
brew 'fish'
brew 'ffmpeg'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'gitleaks'
brew 'git-crypt'
brew 'git-delta'
brew 'git-lfs'
brew 'gnu-sed'
brew 'graphviz'
brew 'grc'
brew 'helmfile'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'lazygit'
brew 'jenv'
brew 'jq'
brew 'jump'
brew 'molecule'
brew 'moreutils'
brew 'nvim'
brew 'openssl@3'
brew 'opentofu'
brew 'packer'
brew 'pandoc'
brew 'pgcli'
brew 'plantuml'
brew 'poppler'
brew 'protobuf'
brew 'pstree'
brew 'pyenv'
brew 'ripgrep'
brew 'screenfetch'
brew 'shellcheck'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'starship'
brew 'stylua'
brew 'tailscale'
brew 'terraform'
brew 'terragrunt'
brew 'tig'
brew 'tree'
brew 'unar'
brew 'watch'
brew 'wget'
brew 'yazi'
brew 'ykman'
brew 'zoxide'

# development
brew 'ant'
brew 'delve'
brew 'gopls'
brew 'gradle'
brew 'lua'
brew 'maven'
brew 'rustup'
brew 'sccache'
brew 'zig'

# dev tools installed with asdf
#brew 'go'
#brew 'kotlin'
#brew 'python'
#brew 'ruby'
#brew 'scala'
#cask 'temurin'

# gnupg related tools
brew 'gnupg'
brew 'hopenpgp-tools'
brew 'ykman'

# tmux related tools
brew 'tmux'
brew 'tpm'
brew 'arl/arl/gitmux'

# zsh
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-history-substring-search'
brew 'zsh-syntax-highlighting'
brew 'zsh-fast-syntax-highlighting'

# macos apps
cask_args appdir: '/Applications'
cask 'alacritty'
cask 'amethyst'
cask 'brave-browser'
cask 'discord'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'microsoft-teams'
cask 'obsidian'
cask 'orbstack'
cask 'raycast'
cask 'spotify'
cask 'vscodium'
cask 'wezterm'
