# -*- mode: ruby -*-
# Brewfile
#
# Use `brew bundle install --file <Brewfile>` to install the formulas listed below.

brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'btop'
brew 'bzip2'
brew 'ca-certificates'
brew 'coreutils'
brew 'csshx'
brew 'curl'
brew 'diff-so-fancy'
brew 'dockutil'
brew 'dos2unix'
brew 'eza'
brew 'fish'
brew 'gh'
brew 'git'
brew 'git-crypt'
brew 'git-lfs'
brew 'gnu-sed'
brew 'graphviz'
brew 'grc'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jenv'
brew 'jq'
brew 'jump'
brew 'molecule'
brew 'moreutils'
brew 'nvim'
brew 'openssl@3'
brew 'packer'
brew 'pandoc'
brew 'plantuml'
brew 'protobuf'
brew 'pstree'
brew 'pyenv'
brew 'screenfetch'
brew 'shellcheck'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'starship'
brew 'tailscale'
brew 'terraform'
brew 'tig'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# development
brew 'ant'
brew 'go'
brew 'gradle'
brew 'kotlin'
brew 'maven'
brew 'python'
brew 'rustup-init'
brew 'scala'
cask 'temurin'

# gnupg related tools
brew 'gnupg'
brew 'hopenpgp-tools'
brew 'ykman'

# macos apps
cask_args appdir: '/Applications'
cask 'alacritty'
cask 'amethyst'
cask 'brave-browser'
cask 'hammerspoon'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'microsoft-teams'
cask 'spotify'
cask 'vscodium'
