# -*- mode: ruby -*-
# Brewfile
#
# Use `brew bundle install --file ,Brewfile>` to install the formulas listed below.

brew 'ansible'
brew 'autoconf'
brew 'automake'
brew 'awscli'
brew 'azure-cli'
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'bzip2'
brew 'ca-certificates'
brew 'coreutils'
brew 'csshx'
brew 'curl'
brew 'diff-so-fancy'
brew 'dos2unix'
brew 'eza'
brew 'gh'
brew 'git'
brew 'git-crypt'
brew 'git-lfs'
brew 'gnu-sed'
brew 'graphviz'
brew 'grc'
brew 'htop'
brew 'httpie'
brew 'hub'
brew 'jq'
brew 'jump'
brew 'molecule'
brew 'moreutils'
brew 'nvim'
brew 'openssl@3'
brew 'packer'
brew 'pandoc'
brew 'plantuml'
brew 'protobuf'
brew 'pstree'
brew 'screenfetch'
brew 'shellcheck'
brew 'sqlite'
brew 'ssh-copy-id'
brew 'starship'
brew 'terraform'
brew 'tmux'
brew 'tree'
brew 'watch'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'
